# 기술 통계량 : 데이터를 요약하는 대푯값, summary()
## 데이터를 의미있는 숫자로 요약하여 데이터의 특성을 파악하는 방법

### 평균 : mean
## A식당 배달시간
storeA <- c(20,21,23,22,26,28,35,35,41,42,43,45,44,45,46,47,47,46,47,58,58,59,60,56,57,57,80)
## B식당 배달시간
storeB <- c(5,6,11,13,15,16,20,20,21,23,22,27,27,30,30,32,36,37,37,40,40,43,44,45,51,54,70,600)
## C식당 배달시간
storeC <- c(5,5,5,12,10,11,20,20,20,20,20,21,20,30,32,31,31,31,36,40,40,51,61,51,61,61,70)

### A식당과 B식당중 어느식당이 배달시간이 가장 빠른지 분석
mean(storeA)
mean(storeB)

#### 600보다 작은 값을 대상으로 평균
mean(storeB[storeB < 600])

### 중앙값 : median
nums <- c(1, 5, 2, 3, 1000)

# 평균
mean(nums)

# 중앙값
median(nums)
nums <- c(1, 5, 2, 1000)

# 짝수일땐 중앙값 두개의 평균
median(storeA)
median(storeB)

#-----------------------------------------------------------------
#사분위수
#-----------------------------------------------------------------
nums <- 1:17

quantile(nums)

## 중앙값이 동일한 집단 벡터 생성
A <- c(0,1,1,1,5,9,9,9,10)
B <- c(0,4,4,4,5,6,6,6,10)

# A집단
median(A)
median(B)

quantile(storeA)
quantile(storeB)

# boxplot : 상자수염그래프
boxplot(storeB)
boxplot(storeA, storeB, names = c('A식당','B식당'))

storeB <- c(5,6,11,13,15,16,20,20,21,23,22,27,27,30,30,32,36,37,37,40,40,43,44,45,51,54,70)
